Revit 2027 API
EnergyAnalysisDetailModel.Create(Document, EnergyAnalysisDetailModelOptions) Method
Note: This API is now obsolete.
 Creates a new energy analysis detailed model.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This function is deprecated in Revit 2027 and will be removed in the next version of Revit.")]
public static EnergyAnalysisDetailModel Create(
	Document document,
	EnergyAnalysisDetailModelOptions options
)
<ObsoleteAttribute("This function is deprecated in Revit 2027 and will be removed in the next version of Revit.")>
Public Shared Function Create (
	document As Document,
	options As EnergyAnalysisDetailModelOptions
) As EnergyAnalysisDetailModel
public:
[ObsoleteAttribute(L"This function is deprecated in Revit 2027 and will be removed in the next version of Revit.")]
static EnergyAnalysisDetailModel^ Create(
	Document^ document,
	EnergyAnalysisDetailModelOptions^ options
)
[<ObsoleteAttribute("This function is deprecated in Revit 2027 and will be removed in the next version of Revit.")>]
static member Create :
        document : Document *
        options : EnergyAnalysisDetailModelOptions -> EnergyAnalysisDetailModel
Parameters
document Document
 The document that contains the physical model of the building.
options EnergyAnalysisDetailModelOptions
 The options to control the calculation rules.
Return Value
EnergyAnalysisDetailModel
 The created model instance.
Exceptions
Exception | Condition
ArgumentException |  Throws if there are no valid spatial bounding elements, or no valid spatial elements in the document.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Failed to create the energy analysis detail model.
OperationCanceledException |  Throws if user aborted the energy analysis detail model creation.
Remarks
 The generated energy model is always returned in world coordinates. The method TransformModel() transforms all surfaces in the model according to ground plane, shared coordinates and true north.
See Also
Reference
EnergyAnalysisDetailModel Class
Create Overload
Autodesk.Revit.DB.Analysis Namespace